# BoundingBoxUV Class

---
A two-dimensional rectangle, parallel to the coordinate axes.
SystemObject Autodesk.Revit.DBBoundingBoxUV
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class BoundingBoxUV : IDisposable

    Public Class BoundingBoxUV
    	Implements IDisposable

    public ref class BoundingBoxUV : IDisposable

    type BoundingBoxUV =
        class
            interface IDisposable
        end
The BoundingBoxUV type exposes the following members.
| Name| Description
---|---|---
| BoundingBoxUV| default constructor
| BoundingBoxUV(Double, Double, Double, Double)| Creates object with supplied values.
Top
| Name| Description
---|---|---
| Bounds| Indexed access for loops. Use 0 for Min and 1 for Max.
| IsSet| Indicates whether the BoundingBoxUV is set or not.
| Max| Maximum coordinates (upper-right corner of the box).
| Min| Minimum coordinates (lower-left corner of the box).
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the BoundingBoxUV
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace